{
  "flashcards": [
    {
      "id": 1,
      "front": "SQL Injection",
      "back": "A type of attack where the attacker manipulates a SQL query. Prevent it by using prepared statements and parameterized queries."
    },
    {
      "id": 2,
      "front": "Cross-Site Scripting (XSS)",
      "back": "Occurs when attackers inject malicious scripts into content from trusted websites. Mitigate by validating and escaping user input."
    },
    {
      "id": 3,
      "front": "Cross-Site Request Forgery (CSRF)",
      "back": "An attack that forces an end user to execute unwanted actions. Prevent with anti-CSRF tokens and same-site cookies."
    },
    {
      "id": 4,
      "front": "Public Key Cryptography",
      "back": "A cryptographic system that uses pairs of keys: public keys (openly shared) and private keys (kept secret). Used for secure data transmission."
    },
    {
      "id": 5,
      "front": "Principle of Least Privilege",
      "back": "Each user or program should have the least privileges necessary to perform their tasks, reducing the scope of potential damage."
    },
    {
      "id": 6,
      "front": "Secure Sockets Layer (SSL)/Transport Layer Security (TLS)",
      "back": "Protocols for securing communications over a computer network. Websites should use HTTPS to ensure data is encrypted in transit."
    },
    {
      "id": 7,
      "front": "Two-Factor Authentication (2FA)",
      "back": "An extra layer of security used to ensure that people trying to access an online account are who they say they are."
    },
    {
      "id": 8,
      "front": "Password Hashing",
      "back": "Transforms a password into another form, a 'hash', to secure password storage. Use strong hashing algorithms like bcrypt."
    },
    {
      "id": 9,
      "front": "Session Management",
      "back": "Securely managing user sessions is critical. Implement timeouts, re-authentication for sensitive features, and secure cookie settings."
    },
    {
      "id": 10,
      "front": "Input Validation",
      "back": "Ensuring only properly formatted data is entered into a system. Helps mitigate a variety of injections and attacks."
    }
  ]
}
